app/Views/StaffPage/managenewstaff.php

                                                        <?php
                                                        // Fetch category name based on category_id
                                                        $categoryModel = new \App\Models\CategoryModel();
                                                        $category = $categoryModel->find($newsItem['category_id']);
---
SELECT *
FROM `category`
WHERE `category`.`category_id` = '4'