app/Controllers/AnnounceController.php

    public function announcements()
    {
        $categoryModel = new CategoryModel();
        $categories = $categoryModel->findAll();
---
SELECT *
FROM `category`
SELECT *
FROM `news_categories`