app/Controllers/CategoryController.php

SELECT *
FROM `news_categories`
---
    public function getcategory()
    {
        // Load the CategoryModel
        $categoryModel = new CategoryModel();

        // Fetch all categories from the database
        $data['category'] = $categoryModel->findAll();