app/Controllers/LogRegController.php

        public function check()
    {
        // Include form helper
        helper(['form']);

        // Set rules for form validation
        $rules = [
            'email' => 'required|valid_email',
            'password' => 'required|min_length[6]|max_length[255]'
        ];

        if ($this->validate($rules)) {
            $model = new UsersModel();
            $email = $this->request->getVar('email');
            $password = $this->request->getVar('password');
            $data = $model->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'evaro@gmail.com'
 LIMIT 1

                    $loginData = [
                        'log_status' => 'Logged In'
                    ];
                    $model->update($data['user_id'], $loginData);
---
UPDATE `users` SET `log_status` = 'Logged In'
WHERE `users`.`user_id` IN ('9')