app/Controllers/NewsStaffController.php

    public function managenewstaff()
    {
        // Load the required models
        $newsModel = new NewsModel();
        $userModel = new UsersModel();

        // Fetch news data from the database, joining with the users table to filter by role "Staff"
        $staffNewsData = $newsModel->select('news.*')
                                    ->join('users', 'users.staff_id = news.staff_id')
                                    ->where('users.role', 'Staff')
                                    ->findAll();
---
SELECT `news`.*
FROM `news`
JOIN `users` ON `users`.`staff_id` = `news`.`staff_id`
WHERE `users`.`role` = 'Staff'
AND `news`.`deleted_at` IS NULL

    public function newsUpdate()
    {
        // Retrieve the submitted form data
        $newsId = $this->request->getPost('news_id');
        $title = $this->request->getPost('title');
        $author = $this->request->getPost('author');
        $categoryId = $this->request->getPost('category_id');
        $content = $this->request->getPost('content');
        $remarks = $this->request->getPost('remarks');

        // Load the NewsModel
        $newsModel = new NewsModel();

        // Check if the news with the given ID exists
        $news = $newsModel->find($newsId);
        if (!$news) {
            return "News not found"; // Handle error appropriately
        }

        // Check if the provided category ID exists
        $categoryModel = new CategoryModel();
        $category = $categoryModel->find($categoryId);
---
SELECT *
FROM `news`
WHERE `news`.`deleted_at` IS NULL
AND `news`.`news_id` = '121'
SELECT *
FROM `category`
WHERE `category`.`category_id` = 'undefined'