app/Controllers/NewsStaffController.php

SELECT *
FROM `category`
---
    public function createnews()
    {
        try {
            $categoryModel = new CategoryModel();
            $categories = $categoryModel->findAll();