app/Controllers/NewsController.php

SELECT *
FROM `news`
---
    public function managenews()
    {
        // Load the NewsModel
        $newsModel = new NewsModel();

        // Fetch news data from the database
        $data['newsData'] = $newsModel->findAll(); // Assuming findAll() fetches all news items