app/Controllers/ProfileController.php

    public function manageusers()
    {
        // Load the UserModel
        $usersModel = new UsersModel();

        // Select specific fields from the database, including 'user_id', and filter by role 'User'
        $userData = $usersModel->select('user_id, firstname, lastname, address, email, contact_number, image, role, gender, login_status, last_login_status')
                                ->where('role', 'User') // Filter by role 'User'
                                ->findAll();
---
SELECT `user_id`, `firstname`, `lastname`, `address`, `email`, `contact_number`, `image`, `role`, `gender`, `login_status`, `last_login_status`
FROM `users`
WHERE `role` = 'User'