app/Controllers/UserController.php

        $categoryModel = new CategoryModel();

        // Fetch all categories
        $categories = $categoryModel->findAll();
---
SELECT *
FROM `category`