app/Controllers/UserController.php

    public function news_read($news_id)
    {
        $newsModel = new NewsModel();

        // Fetch article details by news_id
        $article = $newsModel->find($news_id);

        // Fetch category name using the category_id
        $categoryModel = new CategoryModel();
        $category = $categoryModel->find($article['category_id']);
        $category_name = $category ? $category['category_name'] : '';

        // Pass data to view
        $data = [
            'article' => $article,
            'category_name' => $category_name,
        ];

        // Fetch comments with status 'approved'
        $commentModel = new CommentModel();
        $data['comments'] = $commentModel->where('news_id', $news_id)
                                        ->where('comment_status', 'approved')
                                        ->findAll();
---
SELECT *
FROM `news`
WHERE `news`.`news_id` = '59'
SELECT *
FROM `category`
WHERE `category`.`category_id` = '2'
SELECT *
FROM `comment`
WHERE `news_id` = '59'
AND `comment_status` = 'approved'

    public function filterNews($categoryName = null)
    {
        try {
            // Load the news model
            $newsModel = new NewsModel();

            // If no specific category is selected, fetch all news articles
            if ($categoryName === null || $categoryName === 'all') {
                $newsData = $newsModel->findAll();
            } else {
                // Fetch news articles filtered by the selected category name
                $newsData = $newsModel->select('news.*, images')
                                    ->join('category', 'category.category_id = news.category_id')
                                    ->where('category.category_name', $categoryName)
                                    ->findAll();
---
SELECT `news`.*, `images`
FROM `news`
JOIN `category` ON `category`.`category_id` = `news`.`category_id`
WHERE `category`.`category_name` = 'Technology'

    public function like()
    {
        // Check if the user is logged in
        if (!session()->has('user_id')) {
            // Redirect the user to the login page
            return redirect()->to(base_url('login'));
        }

        // Get the news ID and action from the POST data
        $newsId = $this->request->getPost('newsId');
        $action = $this->request->getPost('action');

        // Get the user ID from the session
        $userId = session()->get('user_id');

        // Create an instance of the LikeModel
        $likeModel = new LikeModel();

        // Check if the user has already liked or disliked the news
        $existingLike = $likeModel->where('news_id', $newsId)
                                  ->where('user_id', $userId)
                                  ->first();
---
SELECT *
FROM `likes`
WHERE `news_id` = '59'
AND `user_id` = '10'
 LIMIT 1

    public function about()
    {
        $categoryModel = new CategoryModel();
        $categories = $categoryModel->findAll();
---
SELECT *
FROM `category`