app/Controllers/UserController.php

SELECT *
FROM `category`
---
    public function home()
    {
        $categoryModel = new CategoryModel();
        $categories = $categoryModel->findAll();

SELECT *
FROM `category`
---
    public function about()
    {
        $categoryModel = new CategoryModel();
        $categories = $categoryModel->findAll();